### Import pandas

In [83]:
import pandas as pd

test_series=pd.Series(['a','b','c','d','e'])
test_series

0    a
1    b
2    c
3    d
4    e
dtype: object

### Series

In [85]:
s1=pd.Series(['smile','love','peace'])
s1

0    smile
1     love
2    peace
dtype: object

In [87]:
import numpy as np
s2=pd.Series(np.arange(5),index=['a','b','c','d','e'])
s2

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [88]:
s3_dict={'name':'Tom','age':29,'sex':1}
s3=pd.Series(s3_dict)
s3

name    Tom
age      29
sex       1
dtype: object

In [90]:
s2=pd.Series(np.arange(5),index=['a','b','c','d','e'])
print(s2['a'])
print()
print(s2[['a','c','e']])#여러 개의 값을 indexing 할 때는 리스트로 넣어줌

0

a    0
c    2
e    4
dtype: int32

In [92]:
s4=pd.Series(np.arange(10))
print(s4)
s4[s4>5]

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

6    6
7    7
8    8
9    9
dtype: int32

In [93]:
s4*2

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
9    18
dtype: int32

In [94]:
s4

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [95]:
s5=pd.Series([1,2,np.nan],index=['a','b','c'])
s5

a    1.0
b    2.0
c    NaN
dtype: float64

In [97]:
s5.values

array([ 1.,  2., nan])

In [98]:
s5

a    1.0
b    2.0
c    NaN
dtype: float64

In [99]:
s5.index

Index(['a', 'b', 'c'], dtype='object')

In [101]:
pd.isnull(s5)

a    False
b    False
c     True
dtype: bool

In [106]:
s6=pd.Series([1,2,3],index=['a','b','c'])
s6

a    1
b    2
c    3
dtype: int64

In [107]:
s5+s6

a    2.0
b    4.0
c    NaN
dtype: float64

### DataFrame

In [8]:
player_dict={'이름':["류현진",'김연아','손흥민'],
            '종목' : ['야구','피겨','축구'],
            '나이' : [29,25,26]}
player_df=pd.DataFrame(player_dict,index={'선수1','선수2','선수3'})
player_df

      이름  종목  나이
선수3  류현진  야구  29
선수1  김연아  피겨  25
선수2  손흥민  축구  26

In [5]:
player_df['이름']

선수3    류현진
선수1    김연아
선수2    손흥민
Name: 이름, dtype: object

In [6]:
type(player_df['이름'])

pandas.core.series.Series

In [10]:
player_df[['나이','이름']] #리스트 형태로 넣어줘야함(주의)

     나이   이름
선수3  29  류현진
선수1  25  김연아
선수2  26  손흥민

In [11]:
type(player_df[['나이','이름']])

pandas.core.frame.DataFrame

In [12]:
player_df[0:2]

      이름  종목  나이
선수3  류현진  야구  29
선수1  김연아  피겨  25

In [13]:
player_df['이름'][0:2]

선수3    류현진
선수1    김연아
Name: 이름, dtype: object

### loc & iloc

In [14]:
player_df.loc['선수1'] #해당 row 선택

이름    김연아
종목     피겨
나이     25
Name: 선수1, dtype: object

In [15]:
player_df['이름'].loc['선수1']

'김연아'

In [16]:
player_df.iloc[1:]

      이름  종목  나이
선수1  김연아  피겨  25
선수2  손흥민  축구  26

In [17]:
player_df['종목'].iloc[:2]

선수3    야구
선수1    피겨
Name: 종목, dtype: object

### 칼럼추가

In [18]:
player_df

      이름  종목  나이
선수3  류현진  야구  29
선수1  김연아  피겨  25
선수2  손흥민  축구  26

In [20]:
player_df['최고연봉']=[110,15,80]
player_df

      이름  종목  나이  최고연봉
선수3  류현진  야구  29   110
선수1  김연아  피겨  25    15
선수2  손흥민  축구  26    80

In [23]:
#import numpy as np
player_df['고액연봉']=np.where(player_df['최고연봉']>50,1,0)
player_df

      이름  종목  나이  최고연봉  고액연봉
선수3  류현진  야구  29   110     1
선수1  김연아  피겨  25    15     0
선수2  손흥민  축구  26    80     1

In [24]:
player_df[player_df['나이']>25]

      이름  종목  나이  최고연봉  고액연봉
선수3  류현진  야구  29   110     1
선수2  손흥민  축구  26    80     1

### del

In [25]:
del player_df['고액연봉']
player_df

      이름  종목  나이  최고연봉
선수3  류현진  야구  29   110
선수1  김연아  피겨  25    15
선수2  손흥민  축구  26    80

In [27]:
player_df.drop(['나이','최고연봉'],axis=1)

      이름  종목
선수3  류현진  야구
선수1  김연아  피겨
선수2  손흥민  축구

In [28]:
player_df.drop('선수3')

      이름  종목  나이  최고연봉
선수1  김연아  피겨  25    15
선수2  손흥민  축구  26    80

In [29]:
player_df.drop(['선수1','선수2'])

      이름  종목  나이  최고연봉
선수3  류현진  야구  29   110

In [31]:
player_df=player_df.drop('선수3')
player_df

      이름  종목  나이  최고연봉
선수1  김연아  피겨  25    15
선수2  손흥민  축구  26    80

### DataFrame Operation

In [33]:
df1=pd.DataFrame({"a":[0,3,6],"b":[1,4,7],"c":[2,5,8]})
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [34]:
df2=pd.DataFrame({"a":[0,4,8,12],"b":[1,5,9,13],"c":[2,6,10,14],"d":[3,7,11,15]})
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [35]:
df1+df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [36]:
df1.add(df2,fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [37]:
s=pd.Series(np.arange(5))
s

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [38]:
s.map(lambda x:x**2)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [40]:
def zero_one(x):
    result=np.where(x>2,'a','b')
    return result

s.map(zero_one)

0    b
1    b
2    b
3    a
4    a
dtype: object

In [41]:
change_dict={0:"A",1:"B",2:"C"}
s.map(change_dict)

0      A
1      B
2      C
3    NaN
4    NaN
dtype: object

In [43]:
info_df=pd.DataFrame({'age':[30,25,25,12,40],'height':[178,180,160,140,176],'weight':[80,100,55,40,70]})
info_df

   age  height  weight
0   30     178      80
1   25     180     100
2   25     160      55
3   12     140      40
4   40     176      70

In [44]:
f=lambda x:1 if x>=30 else 30
info_df['age'].map(f)

0     1
1    30
2    30
3    30
4     1
Name: age, dtype: int64

In [45]:
info_df['age_code']=info_df['age'].map(f)
info_df

   age  height  weight  age_code
0   30     178      80         1
1   25     180     100        30
2   25     160      55        30
3   12     140      40        30
4   40     176      70         1